#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
random_id.db_suffix: Refreshing state... [id=1ktCfQ]
google_project_service.artifactregistry: Refreshing state... [id=fullstack-app-base/artifactregistry.googleapis.com]
google_project_service.vpcaccess: Refreshing state... [id=fullstack-app-base/vpcaccess.googleapis.com]
google_project_service.iamcredentials: Refreshing state... [id=fullstack-app-base/iamcredentials.googleapis.com]
google_project_service.sqladmin: Refreshing state... [id=fullstack-app-base/sqladmin.googleapis.com]
google_service_account.cloud_run: Refreshing state... [id=projects/fullstack-app-base/serviceAccounts/fullstack-app-cloud-run-sa@fullstack-app-base.iam.gserviceaccount.com]
google_project_service.run: Refreshing state... [id=fullstack-app-base/run.googleapis.com]
google_project_service.sts: Refreshing state... [id=fullstack-app-base/sts.googleapis.com]
google_compute_network.vpc: Refreshing state... [id=projects/fullstack-app-base/global/networks/fullstack-app-vpc]
google_project_service.iam: Refreshing state... [id=fullstack-app-base/iam.googleapis.com]
google_project_service.servicenetworking: Refreshing state... [id=fullstack-app-base/servicenetworking.googleapis.com]
google_project_service.compute: Refreshing state... [id=fullstack-app-base/compute.googleapis.com]
google_project_iam_member.cloud_sql_instance_user: Refreshing state... [id=fullstack-app-base/roles/cloudsql.instanceUser/serviceAccount:fullstack-app-cloud-run-sa@fullstack-app-base.iam.gserviceaccount.com]
google_project_iam_member.cloud_sql_client: Refreshing state... [id=fullstack-app-base/roles/cloudsql.client/serviceAccount:fullstack-app-cloud-run-sa@fullstack-app-base.iam.gserviceaccount.com]
google_compute_global_address.private_ip_address: Refreshing state... [id=projects/fullstack-app-base/global/addresses/fullstack-app-private-ip]
google_service_account.github_actions: Refreshing state... [id=projects/fullstack-app-base/serviceAccounts/fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com]
google_service_networking_connection.private_vpc_connection: Refreshing state... [id=projects%2Ffullstack-app-base%2Fglobal%2Fnetworks%2Ffullstack-app-vpc:servicenetworking.googleapis.com]
google_artifact_registry_repository.backend: Refreshing state... [id=projects/fullstack-app-base/locations/asia-northeast1/repositories/backend]
google_iam_workload_identity_pool.github_actions: Refreshing state... [id=projects/fullstack-app-base/locations/global/workloadIdentityPools/fullstack-app-github-pool]
google_vpc_access_connector.connector: Refreshing state... [id=projects/fullstack-app-base/locations/asia-northeast1/connectors/fullstack-app-vpc-conn]
google_project_iam_member.github_actions_cloud_run_admin: Refreshing state... [id=fullstack-app-base/roles/run.admin/serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com]
google_project_iam_member.github_actions_vpcaccess_viewer: Refreshing state... [id=fullstack-app-base/roles/vpcaccess.viewer/serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com]
google_project_iam_member.github_actions_sa_user: Refreshing state... [id=fullstack-app-base/roles/iam.serviceAccountUser/serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com]
google_project_iam_member.github_actions_cloud_sql_admin: Refreshing state... [id=fullstack-app-base/roles/cloudsql.admin/serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com]
google_project_iam_member.github_actions_project_iam_admin: Refreshing state... [id=fullstack-app-base/roles/resourcemanager.projectIamAdmin/serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com]
google_project_iam_member.github_actions_workload_identity_pool_admin: Refreshing state... [id=fullstack-app-base/roles/iam.workloadIdentityPoolAdmin/serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com]
google_project_iam_member.github_actions_storage_admin: Refreshing state... [id=fullstack-app-base/roles/storage.admin/serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com]
google_project_iam_member.github_actions_compute_network_viewer: Refreshing state... [id=fullstack-app-base/roles/compute.networkViewer/serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com]
google_project_iam_member.github_actions_service_account_admin: Refreshing state... [id=fullstack-app-base/roles/iam.serviceAccountAdmin/serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com]
google_project_iam_member.github_actions_artifact_registry_admin: Refreshing state... [id=fullstack-app-base/roles/artifactregistry.admin/serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com]
google_service_account_iam_member.github_actions_workload_identity: Refreshing state... [id=projects/fullstack-app-base/serviceAccounts/fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/853642690014/locations/global/workloadIdentityPools/fullstack-app-github-pool/attribute.repository/TomokiIshimine/fullstack-app-with-claude]
google_iam_workload_identity_pool_provider.github_actions: Refreshing state... [id=projects/fullstack-app-base/locations/global/workloadIdentityPools/fullstack-app-github-pool/providers/fullstack-app-github-provider]
google_sql_database_instance.main: Refreshing state... [id=fullstack-app-db-d64b427d]
google_sql_user.iam_user: Refreshing state... [id=fullstack-app-cloud-run-sa/%/fullstack-app-db-d64b427d]
google_sql_database.database: Refreshing state... [id=projects/fullstack-app-base/instances/fullstack-app-db-d64b427d/databases/app_db]
google_sql_user.user: Refreshing state... [id=app_user//fullstack-app-db-d64b427d]
google_cloud_run_v2_job.db_migrate: Refreshing state... [id=projects/fullstack-app-base/locations/asia-northeast1/jobs/fullstack-app-db-migrate]
google_cloud_run_service.backend: Refreshing state... [id=locations/asia-northeast1/namespaces/fullstack-app-base/services/fullstack-app-backend]
google_cloud_run_service_iam_member.public_access: Refreshing state... [id=v1/projects/fullstack-app-base/locations/asia-northeast1/services/fullstack-app-backend/roles/run.invoker/allUsers]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_cloud_run_service.backend will be updated in-place
  ~ resource "google_cloud_run_service" "backend" {
        id                         = "locations/asia-northeast1/namespaces/fullstack-app-base/services/fullstack-app-backend"
        name                       = "fullstack-app-backend"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ metadata {
              ~ labels           = {
                  - "client.knative.dev/nonce"            = "kxizfqjygr" -> null
                    # (4 unchanged elements hidden)
                }
                name             = null
                # (6 unchanged attributes hidden)
            }
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                    name        = null
                    # (4 unchanged attributes hidden)

                  # Warning: this block will no longer be marked as sensitive
                  # after applying this change.
                  ~ env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
                  # Warning: this block will no longer be marked as sensitive
                  # after applying this change.
                  ~ env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
                  - env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
                  # Warning: this block will no longer be marked as sensitive
                  # after applying this change.
                  ~ env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
                  # Warning: this block will no longer be marked as sensitive
                  # after applying this change.
                  ~ env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
                  # Warning: this block will no longer be marked as sensitive
                  # after applying this change.
                  ~ env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
                  # Warning: this block will no longer be marked as sensitive
                  # after applying this change.
                  ~ env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
                  - env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
                  - env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
                  # Warning: this block will no longer be marked as sensitive
                  # after applying this change.
                  ~ env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
                  + env {
                      + name  = "FLASK_SECRET_KEY"
                        # (1 unchanged attribute hidden)

                      + value_from {
                          + secret_key_ref {
                              + key  = "latest"
                              + name = "fullstack-app-flask-secret-key"
                            }
                        }
                    }
                  + env {
                      + name  = "JWT_SECRET_KEY"
                        # (1 unchanged attribute hidden)

                      + value_from {
                          + secret_key_ref {
                              + key  = "latest"
                              + name = "fullstack-app-jwt-secret-key"
                            }
                        }
                    }

                    # (3 unchanged blocks hidden)
                }
            }
        }

        # (2 unchanged blocks hidden)
    }

  # google_cloud_run_v2_job.db_migrate will be updated in-place
  ~ resource "google_cloud_run_v2_job" "db_migrate" {
      - client                   = "gcloud" -> null
      - client_version           = "545.0.0" -> null
        id                       = "projects/fullstack-app-base/locations/asia-northeast1/jobs/fullstack-app-db-migrate"
        name                     = "fullstack-app-db-migrate"
        # (23 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_project_service.secretmanager will be created
  + resource "google_project_service" "secretmanager" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "fullstack-app-base"
      + service            = "secretmanager.googleapis.com"
    }

  # google_secret_manager_secret.flask_secret_key will be created
  + resource "google_secret_manager_secret" "flask_secret_key" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "app"         = "fullstack-app"
          + "environment" = "production"
          + "managed_by"  = "terraform"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + labels                = {
          + "app"         = "fullstack-app"
          + "environment" = "production"
          + "managed_by"  = "terraform"
        }
      + name                  = (known after apply)
      + project               = "fullstack-app-base"
      + secret_id             = "fullstack-app-flask-secret-key"
      + terraform_labels      = {
          + "app"         = "fullstack-app"
          + "environment" = "production"
          + "managed_by"  = "terraform"
        }

      + replication {
          + auto {
            }
        }
    }

  # google_secret_manager_secret.jwt_secret_key will be created
  + resource "google_secret_manager_secret" "jwt_secret_key" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "app"         = "fullstack-app"
          + "environment" = "production"
          + "managed_by"  = "terraform"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + labels                = {
          + "app"         = "fullstack-app"
          + "environment" = "production"
          + "managed_by"  = "terraform"
        }
      + name                  = (known after apply)
      + project               = "fullstack-app-base"
      + secret_id             = "fullstack-app-jwt-secret-key"
      + terraform_labels      = {
          + "app"         = "fullstack-app"
          + "environment" = "production"
          + "managed_by"  = "terraform"
        }

      + replication {
          + auto {
            }
        }
    }

  # google_secret_manager_secret_iam_member.flask_secret_access will be created
  + resource "google_secret_manager_secret_iam_member" "flask_secret_access" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:fullstack-app-cloud-run-sa@fullstack-app-base.iam.gserviceaccount.com"
      + project   = "fullstack-app-base"
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "fullstack-app-flask-secret-key"
    }

  # google_secret_manager_secret_iam_member.jwt_secret_access will be created
  + resource "google_secret_manager_secret_iam_member" "jwt_secret_access" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:fullstack-app-cloud-run-sa@fullstack-app-base.iam.gserviceaccount.com"
      + project   = "fullstack-app-base"
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "fullstack-app-jwt-secret-key"
    }

  # google_secret_manager_secret_version.flask_secret_key will be created
  + resource "google_secret_manager_secret_version" "flask_secret_key" {
      + create_time           = (known after apply)
      + deletion_policy       = "DELETE"
      + destroy_time          = (known after apply)
      + enabled               = true
      + id                    = (known after apply)
      + is_secret_data_base64 = false
      + name                  = (known after apply)
      + secret                = (known after apply)
      + secret_data           = (sensitive value)
      + version               = (known after apply)
    }

  # google_secret_manager_secret_version.jwt_secret_key will be created
  + resource "google_secret_manager_secret_version" "jwt_secret_key" {
      + create_time           = (known after apply)
      + deletion_policy       = "DELETE"
      + destroy_time          = (known after apply)
      + enabled               = true
      + id                    = (known after apply)
      + is_secret_data_base64 = false
      + name                  = (known after apply)
      + secret                = (known after apply)
      + secret_data           = (sensitive value)
      + version               = (known after apply)
    }

  # google_sql_database_instance.main will be updated in-place
  ~ resource "google_sql_database_instance" "main" {
      ~ deletion_protection            = false -> true
        id                             = "fullstack-app-db-d64b427d"
        name                           = "fullstack-app-db-d64b427d"
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 7 to add, 3 to change, 0 to destroy.

Warning: Argument is deprecated

  with google_sql_database_instance.main,
  on cloud-sql.tf line 23, in resource "google_sql_database_instance" "main":
  23:       require_ssl     = true

`require_ssl` will be fully deprecated in a future major release. For now,
please use `ssl_mode` with a compatible `require_ssl` value instead.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @TomokiIshimine, Action: `pull_request`, Workflow: `Terraform`*